[Successful compilation of /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php]
prompt> [Breakpoint #0 added at /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php:4]
prompt> [Breakpoint #1 added at foo]
prompt> 123
[Breakpoint #1 in foo() at /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php:69, hits: 1]
>00069: 	echo 4;
 00070: }
 00071: $v1=$definedVars[array_rand($definedVars = get_defined_vars())];
prompt> 4NULL
string(11) "random_var:"
int(1)
object(DatePeriod)#1 (7) {
  ["start"]=>
  object(DateTimeImmutable)#4 (3) {
    ["date"]=>
    string(26) "2024-09-10 03:23:49.577280"
    ["timezone_type"]=>
    int(3)
    ["timezone"]=>
    string(3) "UTC"
  }
  ["current"]=>
  NULL
  ["end"]=>
  NULL
  ["interval"]=>
  object(DateInterval)#5 (10) {
    ["y"]=>
    int(2)
    ["m"]=>
    int(0)
    ["d"]=>
    int(4)
    ["h"]=>
    int(6)
    ["i"]=>
    int(8)
    ["s"]=>
    int(0)
    ["f"]=>
    float(0)
    ["invert"]=>
    int(0)
    ["days"]=>
    bool(false)
    ["from_string"]=>
    bool(false)
  }
  ["recurrences"]=>
  int(3)
  ["include_start_date"]=>
  bool(true)
  ["include_end_date"]=>
  bool(false)
}
array(0) {
}
Calling function: finfo_buffer with arguments: 1, 1, 1, 1
Error calling function finfo_buffer: finfo_buffer(): Argument #1 ($finfo) must be of type finfo, int given
Calling function: array_reduce with arguments: Error calling function array_reduce: Object of class DatePeriod could not be converted to string
Calling function: pathinfo with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
1, Array
Error calling function pathinfo: pathinfo(): Argument #2 ($flags) must be of type int, array given
Calling function: socket_set_blocking with arguments: Error calling function socket_set_blocking: Object of class DatePeriod could not be converted to string
Calling function: substr_compare with arguments: Error calling function substr_compare: Object of class DatePeriod could not be converted to string
Calling function: setrawcookie with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Error calling function setrawcookie: Object of class DatePeriod could not be converted to string
Calling function: file with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, 1, Array
Error calling function file: file(): Argument #1 ($filename) must be of type string, array given
Calling function: is_string with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array
Calling function: get_called_class with arguments: 
Calling function: acos with arguments: 1
Calling function: pack with arguments: Error calling function pack: Object of class DatePeriod could not be converted to string
Calling function: readfile with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
1, Array, 1
Error calling function readfile: readfile(): Argument #2 ($use_include_path) must be of type bool, array given
Calling function: array_shift with arguments: Error calling function array_shift: Object of class DatePeriod could not be converted to string
Calling function: ini_alter with arguments: Error calling function ini_alter: Object of class DatePeriod could not be converted to string
Calling function: touch with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Error calling function touch: Object of class DatePeriod could not be converted to string
Calling function: phpdbg_prompt with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array
Error calling function phpdbg_prompt: phpdbg_prompt(): Argument #1 ($string) must be of type string, array given
Calling function: min with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Error calling function min: Object of class DatePeriod could not be converted to string
Calling function: ob_implicit_flush with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array
Error calling function ob_implicit_flush: ob_implicit_flush(): Argument #1 ($enable) must be of type bool, array given
Calling function: stream_context_get_default with arguments: 1
Error calling function stream_context_get_default: stream_context_get_default(): Argument #1 ($options) must be of type ?array, int given
Calling function: stream_filter_append with arguments: Error calling function stream_filter_append: Object of class DatePeriod could not be converted to string
Calling function: fpassthru with arguments: 1
Error calling function fpassthru: fpassthru(): Argument #1 ($stream) must be of type resource, int given
Calling function: xmlwriter_start_dtd with arguments: Error calling function xmlwriter_start_dtd: Object of class DatePeriod could not be converted to string
Calling function: Dom\import_simplexml with arguments: Error calling function Dom\import_simplexml: Object of class DatePeriod could not be converted to string
Calling function: getservbyname with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Error calling function getservbyname: Object of class DatePeriod could not be converted to string
Calling function: phpdbg_color with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, 1
Error calling function phpdbg_color: phpdbg_color(): Argument #1 ($element) must be of type int, array given
Calling function: array_walk with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Error calling function array_walk: Object of class DatePeriod could not be converted to string
Calling function: getimagesizefromstring with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, Array

Warning: getimagesizefromstring(): Argument #2 ($image_info) must be passed by reference, value given in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 41
Error calling function getimagesizefromstring: getimagesizefromstring(): Argument #1 ($string) must be of type string, array given
[Script ended normally]
prompt> Cleaning Execution Environment
Classes    230
Functions  901
Constants  944
Includes   0
[Script ended normally]
prompt> [The command "y" could not be found]
prompt> [Not running]
prompt> 123
[Breakpoint #1 in foo() at /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php:69, hits: 1]
>00069: 	echo 4;
 00070: }
 00071: $v1=$definedVars[array_rand($definedVars = get_defined_vars())];
prompt> 4NULL
string(11) "random_var:"
int(1)
array(0) {
}
array(0) {
}
Calling function: inet_pton with arguments: 1
Calling function: stream_socket_server with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
1, Array, 1, Array, 1

Warning: stream_socket_server(): Argument #2 ($error_code) must be passed by reference, value given in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 41

Warning: stream_socket_server(): Argument #3 ($error_message) must be passed by reference, value given in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 41
Error calling function stream_socket_server: stream_socket_server(): Argument #4 ($flags) must be of type int, array given
Calling function: gc_enabled with arguments: 
Calling function: flock with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, 1, Array

Warning: flock(): Argument #3 ($would_block) must be passed by reference, value given in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 41
Error calling function flock: flock(): Argument #1 ($stream) must be of type resource, array given
Calling function: finfo_open with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, Array
Error calling function finfo_open: finfo_open(): Argument #1 ($flags) must be of type int, array given
Calling function: xmlwriter_end_element with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array
Error calling function xmlwriter_end_element: xmlwriter_end_element(): Argument #1 ($writer) must be of type XMLWriter, array given
Calling function: php_ini_loaded_file with arguments: 
Calling function: strpos with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, Array, Array
Error calling function strpos: strpos(): Argument #1 ($haystack) must be of type string, array given
Calling function: phpdbg_start_oplog with arguments: 
Calling function: ob_clean with arguments: 

Notice: ob_clean(): Failed to delete buffer. No buffer to delete in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 41
Calling function: phpdbg_clear with arguments: 
Calling function: array_find_key with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
1, Array
Error calling function array_find_key: array_find_key(): Argument #1 ($array) must be of type array, int given
Calling function: fpow with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, 1
Error calling function fpow: fpow(): Argument #1 ($num1) must be of type float, array given
Calling function: ftell with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array
Error calling function ftell: ftell(): Argument #1 ($stream) must be of type resource, array given
Calling function: stream_get_transports with arguments: 
Calling function: strtr with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, 1, Array
Error calling function strtr: strtr(): Argument #1 ($string) must be of type string, array given
Calling function: array_uintersect_assoc with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, Array
Error calling function array_uintersect_assoc: array_uintersect_assoc(): Argument #2 must be a valid callback, array callback must have exactly two members
Calling function: json_decode with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, Array, Array, Array
Error calling function json_decode: json_decode(): Argument #1 ($json) must be of type string, array given
Calling function: array_is_list with arguments: 1
Error calling function array_is_list: array_is_list(): Argument #1 ($array) must be of type array, int given
Calling function: iconv_substr with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
1, Array, 1, Array
Error calling function iconv_substr: iconv_substr(): Argument #2 ($offset) must be of type int, array given
Calling function: strspn with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
1, Array, 1, Array
Error calling function strspn: strspn(): Argument #2 ($characters) must be of type string, array given
Calling function: phpversion with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array
Error calling function phpversion: phpversion(): Argument #1 ($extension) must be of type ?string, array given
Calling function: printf with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, Array
Error calling function printf: printf(): Argument #1 ($format) must be of type string, array given
Calling function: base_convert with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, Array, Array
Error calling function base_convert: base_convert(): Argument #1 ($num) must be of type string, array given
Calling function: password_hash with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, 1, Array
Error calling function password_hash: password_hash(): Argument #1 ($password) must be of type string, array given
Calling function: phpdbg_break_function with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array
Error calling function phpdbg_break_function: phpdbg_break_function(): Argument #1 ($function) must be of type string, array given
Calling function: html_entity_decode with arguments: 
Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38

Warning: Array to string conversion in /home/phpfuzz/WorkSpace/flowfusion/php-src/tests/fused/fused538.php on line 38
Array, Array, Array
Error calling function html_entity_decode: html_entity_decode(): Argument #1 ($string) must be of type string, array given
/home/phpfuzz/WorkSpace/flowfusion/php-src/sapi/phpdbg/phpdbg_bp.c:132:16: runtime error: member access within misaligned address 0x00000000004e for type 'phpdbg_breakbase_t' (aka 'struct _phpdbg_breakbase_t'), which requires 8 byte alignment
0x00000000004e: note: pointer points here
<memory cannot be printed>
SUMMARY: UndefinedBehaviorSanitizer: undefined-behavior /home/phpfuzz/WorkSpace/flowfusion/php-src/sapi/phpdbg/phpdbg_bp.c:132:16 in